Tekla Open API Reference for Tekla Structures 2025
SurfaceTreatment.CutByFatherBooleans Property
 Defines if the part is cut by the father's cuts.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public bool CutByFatherBooleans { get; set; }
Public Property CutByFatherBooleans As Boolean
	Get
	Set
Property Value
Type: Boolean
Remarks
Polygon cuts are not supported.
See Also
Reference
SurfaceTreatment Class
Tekla.Structures.Model Namespace